Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--spatialite_overview.tmx
Source language: en
Languages: ja

source: Spatial Database
ja: 空間データベース

source: SpatiaLite is an SQLite_ database engine with spatial functions added.
ja: SpatiaLite は空間を扱う関数を追加した SQLite_ データベースエンジンです。

source: SQLite is a Database Management System (DBMS) which is simple, robust, easy to use and very lightweight. Each SQLite database is simply a file. You can freely copy it, compress it, and port it between Windows, Linux, MacOs etc.
ja: SQLite は動作が軽く、シンプルで堅牢、簡単に使える人気のあるデータベース管理システム (DBMS) です。それぞれのデータベースは一つのファイルに格納されます。コピー、圧縮や、Windows、Linux、MacOS などのOS間の移行も簡単にできます。

source: Core Features
ja: 主な機能

source: The SpatiaLite extension enables SQLite to support spatial data conformant to OGC specifications.
ja: SQLite で OGC の仕様に準拠した空間データを扱えるようにしたものが SpatiaLite の拡張です。

source: Highlights:
ja: ハイライト:

source: User friendly GUI
ja: ユーザフレンドリーな GUI

source: Standard WKT and WKB formats
ja: 標準の WKT 及び WKB フォーマット

source: SQL spatial functions such as AsText(), GeomFromText(), Area(), PointN() ...
ja: SQL 空間関数 - AsText()、GeomFromText()、Area()、PointN() など

source: OpenGis spatial analysis functions provided via GEOS, such as Overlaps(), Touches(), Union(), Buffer() ...
ja: GEOS 経由で提供される OpenGis 空間解析関数 - Overlaps()、Touches()、Union()、Buffer() など

source: Full Spatial metadata in line with OpenGis specifications
ja: OpenGis の仕様に沿った完全な空間メタデータ

source: Numerous Geometry notations - EWKT, GML, KML, and GeoJSON
ja: 多くのジオメトリ記法 - EWKT、GML、KML、GeoJSON

source: Importing and exporting to shapefiles
ja: シェープファイルのインポート、エクスポート

source: Coordinate reprojection via PROJ.4 and EPSG geodetic parameters dataset
ja: PROJ.4 と EPSG 測地系パラメータデータセットを利用した投影法変換

source: Locale charsets via GNU libiconv
ja: GNU libiconv によるロケール、文字コード

source: Spatial Index based on the SQLite's RTree extension
ja: SQLite の RTree 拡張を利用した地理空間インデックス

source: Access shapefiles as VIRTUAL TABLEs, enabling standard SQL queries on external shapefiles, without importing or converting them
ja: シェープファイルに VIRTUAL TABLE としてアクセスすると、インポートや変換なしにシェープファイルに SQL クエリを発行可能

source: Access external CSV/TxtTab files or xls spreadsheets as VIRTUAL TABLEs
ja: 外部の CSV/タブ区切りテキストや xls スプレッドシートに VIRTUAL TABLE としてアクセス

source: Access XML documents, stored BLOB compressed binary objects, including syntactic "well formed" and XSF schema validation constrained checks. Specific support for ISO-Metadata, SLD/SE styles and SVG graphics.XML documents can be queried using standard XPath syntax.
ja: XML ドキュメントやストアド BLOB 圧縮バイナリオブジェクトへの、"well formed" 構文、及び XSF スキーマ妥当性検証チェック付きアクセス。特別に ISOメタデータ、SLD/SE スタイル、SVG グラフィックスをサポート。XML ドキュメントは標準の XPath 構文でクエリ可能。

source: Query external WFS servers.
ja: 外部 WFS サーバへのクエリ

source: Parse external DXF files (all versions) and store layers and geometries found.
ja: 外部の DXF ファイル(全バージョン)のパースと、検出したレイヤとジオメトリの格納

source: Generate and Export DXF files
ja: DXF ファイルの生成とエクスポート

source: Details
ja: 詳細

source: **Website:** http://www.gaia-gis.it/gaia-sins/
ja: **Webサイト:** http://www.gaia-gis.it/gaia-sins/

source: **Licence:** MPL v1.1 and GPL v3
ja: **ライセンス:** MPL v1.1 及び GPL v3

source: **Software Version:** |version-spatialite|
ja: **ソフトウェアバージョン:** |version-spatialite|

source: **Supported Platforms:** Linux, Mac, Windows
ja: **対応プラットフォーム:** Linux, Mac, Windows

source: **API Interfaces:** C
ja: **API インターフェイス:** C

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/spatialite_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/spatialite_quickstart>`
